import React, { useState, useCallback } from 'react';

import { JSONView } from 'antv-site-demo-rc';
import ReactDOM from 'react-dom';
import { Advisor } from '@antv/ava';

const advisor = new Advisor({
  llm: {
    appId: '202508APgb7V00506760',
    authorization: 'TBox-c4ae8a71224e42baaafb1c01d15395a7',
  },
});

const App = () => {
  const [chart, setChart] = useState<React.ReactElement>(null);
  const [data] = useState([
    { 商品类别: '家具', 销售渠道: '物美', 单价: 56.71, 折扣: 0.27 },
    { 商品类别: '办公用品', 销售渠道: '其他', 单价: 1.36, 折扣: 0.87 },
    { 商品类别: '办公用品', 销售渠道: '家乐福', 单价: 6.91, 折扣: 0.18 },
    { 商品类别: '家具', 销售渠道: '世纪联华', 单价: 515.3, 折扣: 0.34 },
    { 商品类别: '办公用品', 销售渠道: '世纪联华', 单价: 1.36, 折扣: 0.87 },
    { 商品类别: '家具', 销售渠道: '大润发', 单价: 515.3, 折扣: 0.34 },
    { 商品类别: '设备', 销售渠道: '其他', 单价: 1122.48, 折扣: 0.29 },
    { 商品类别: '办公用品', 销售渠道: '物美', 单价: 3.91, 折扣: 0.68 },
    { 商品类别: '家具', 销售渠道: '物美', 单价: 382.13, 折扣: 0.49 },
    { 商品类别: '设备', 销售渠道: '家乐福', 单价: 19127.65, 折扣: 0.15 },
    { 商品类别: '设备', 销售渠道: '家乐福', 单价: 15416.89, 折扣: 0.68 },
    { 商品类别: '办公用品', 销售渠道: '沃尔玛', 单价: 3.07, 折扣: 0.41 },
    { 商品类别: '办公用品', 销售渠道: '物美', 单价: 4.49, 折扣: 0.47 },
    { 商品类别: '家具', 销售渠道: '世纪联华', 单价: 388.38, 折扣: 0.75 },
    { 商品类别: '家具', 销售渠道: '家乐福', 单价: 77.21, 折扣: 0.98 },
    { 商品类别: '办公用品', 销售渠道: '世纪联华', 单价: 4.49, 折扣: 0.47 },
    { 商品类别: '设备', 销售渠道: '家乐福', 单价: 14187.19, 折扣: 0.61 },
    { 商品类别: '办公用品', 销售渠道: '沃尔玛', 单价: 4.49, 折扣: 0.47 },
    { 商品类别: '办公用品', 销售渠道: '物美', 单价: 7.27, 折扣: 0.44 },
    { 商品类别: '办公用品', 销售渠道: '欧尚', 单价: 2.7, 折扣: 0.82 },
    { 商品类别: '设备', 销售渠道: '家乐福', 单价: 4848.29, 折扣: 0.42 },
    { 商品类别: '办公用品', 销售渠道: '其他', 单价: 4.61, 折扣: 0.29 },
    { 商品类别: '办公用品', 销售渠道: '物美', 单价: 4.84, 折扣: 0.71 },
    { 商品类别: '设备', 销售渠道: '其他', 单价: 18741.07, 折扣: 0.15 },
    { 商品类别: '办公用品', 销售渠道: '家乐福', 单价: 4.35, 折扣: 0.87 },
    { 商品类别: '办公用品', 销售渠道: '大润发', 单价: 4.35, 折扣: 0.87 },
    { 商品类别: '家具', 销售渠道: '欧尚', 单价: 239.02, 折扣: 0.33 },
    { 商品类别: '家具', 销售渠道: '家乐福', 单价: 237.92, 折扣: 0.72 },
    { 商品类别: '办公用品', 销售渠道: '欧尚', 单价: 2.27, 折扣: 0.69 },
    { 商品类别: '办公用品', 销售渠道: '家乐福', 单价: 6.85, 折扣: 0.7 },
    { 商品类别: '办公用品', 销售渠道: '其他', 单价: 4.52, 折扣: 0.48 },
    { 商品类别: '家具', 销售渠道: '沃尔玛', 单价: 313.73, 折扣: 0.22 },
    { 商品类别: '设备', 销售渠道: '家乐福', 单价: 19597.57, 折扣: 0.47 },
    { 商品类别: '设备', 销售渠道: '世纪联华', 单价: 19597.57, 折扣: 0.47 },
    { 商品类别: '家具', 销售渠道: '家乐福', 单价: 313.73, 折扣: 0.22 },
    { 商品类别: '办公用品', 销售渠道: '大润发', 单价: 4.85, 折扣: 0.3 },
    { 商品类别: '办公用品', 销售渠道: '大润发', 单价: 8.41, 折扣: 0.86 },
    { 商品类别: '办公用品', 销售渠道: '物美', 单价: 9.14, 折扣: 0.38 },
    { 商品类别: '办公用品', 销售渠道: '物美', 单价: 5.02, 折扣: 0.87 },
    { 商品类别: '办公用品', 销售渠道: '世纪联华', 单价: 3.36, 折扣: 0.87 },
    { 商品类别: '办公用品', 销售渠道: '物美', 单价: 5.09, 折扣: 0.21 },
    { 商品类别: '办公用品', 销售渠道: '沃尔玛', 单价: 7.42, 折扣: 0.26 },
    { 商品类别: '办公用品', 销售渠道: '世纪联华', 单价: 9.82, 折扣: 0.63 },
    { 商品类别: '办公用品', 销售渠道: '世纪联华', 单价: 7.99, 折扣: 0.32 },
    { 商品类别: '办公用品', 销售渠道: '其他', 单价: 9.82, 折扣: 0.63 },
    { 商品类别: '家具', 销售渠道: '物美', 单价: 257.04, 折扣: 0.28 },
    { 商品类别: '家具', 销售渠道: '大润发', 单价: 77.21, 折扣: 0.98 },
    { 商品类别: '办公用品', 销售渠道: '世纪联华', 单价: 9.56, 折扣: 0.98 },
    { 商品类别: '家具', 销售渠道: '大润发', 单价: 257.04, 折扣: 0.28 },
    { 商品类别: '家具', 销售渠道: '物美', 单价: 289.42, 折扣: 0.44 },
    { 商品类别: '家具', 销售渠道: '物美', 单价: 289.18, 折扣: 0.85 },
    { 商品类别: '办公用品', 销售渠道: '其他', 单价: 2.7, 折扣: 0.82 },
    { 商品类别: '办公用品', 销售渠道: '家乐福', 单价: 2.7, 折扣: 0.82 },
    { 商品类别: '设备', 销售渠道: '沃尔玛', 单价: 17518.8, 折扣: 0.16 },
    { 商品类别: '设备', 销售渠道: '沃尔玛', 单价: 19720.18, 折扣: 0.16 },
    { 商品类别: '设备', 销售渠道: '家乐福', 单价: 14919.73, 折扣: 0.69 },
    { 商品类别: '办公用品', 销售渠道: '沃尔玛', 单价: 9.55, 折扣: 0.39 },
    { 商品类别: '设备', 销售渠道: '大润发', 单价: 3573.91, 折扣: 0.3 },
    { 商品类别: '设备', 销售渠道: '其他', 单价: 3573.91, 折扣: 0.3 },
    { 商品类别: '办公用品', 销售渠道: '世纪联华', 单价: 4.35, 折扣: 0.87 },
    { 商品类别: '设备', 销售渠道: '其他', 单价: 14959.47, 折扣: 0.16 },
    { 商品类别: '设备', 销售渠道: '家乐福', 单价: 9014.7, 折扣: 0.81 },
    { 商品类别: '家具', 销售渠道: '大润发', 单价: 392.5, 折扣: 0.46 },
    { 商品类别: '办公用品', 销售渠道: '欧尚', 单价: 3.44, 折扣: 0.93 },
    { 商品类别: '办公用品', 销售渠道: '物美', 单价: 9.68, 折扣: 0.86 },
    { 商品类别: '家具', 销售渠道: '欧尚', 单价: 56.19, 折扣: 0.36 },
    { 商品类别: '办公用品', 销售渠道: '物美', 单价: 2.97, 折扣: 0.99 },
    { 商品类别: '办公用品', 销售渠道: '其他', 单价: 3.41, 折扣: 0.39 },
    { 商品类别: '设备', 销售渠道: '物美', 单价: 19531.88, 折扣: 0.32 },
    { 商品类别: '设备', 销售渠道: '物美', 单价: 3830.22, 折扣: 0.12 },
    { 商品类别: '设备', 销售渠道: '沃尔玛', 单价: 1122.48, 折扣: 0.29 },
    { 商品类别: '设备', 销售渠道: '世纪联华', 单价: 15945.6, 折扣: 0.3 },
    { 商品类别: '设备', 销售渠道: '家乐福', 单价: 15945.6, 折扣: 0.3 },
    { 商品类别: '家具', 销售渠道: '家乐福', 单价: 56.71, 折扣: 0.27 },
    { 商品类别: '家具', 销售渠道: '沃尔玛', 单价: 56.71, 折扣: 0.27 },
    { 商品类别: '办公用品', 销售渠道: '沃尔玛', 单价: 1.36, 折扣: 0.87 },
    { 商品类别: '办公用品', 销售渠道: '家乐福', 单价: 3.91, 折扣: 0.68 },
    { 商品类别: '办公用品', 销售渠道: '大润发', 单价: 9.65, 折扣: 0.52 },
    { 商品类别: '办公用品', 销售渠道: '大润发', 单价: 7.42, 折扣: 0.26 },
    { 商品类别: '设备', 销售渠道: '世纪联华', 单价: 15416.89, 折扣: 0.68 },
    { 商品类别: '办公用品', 销售渠道: '其他', 单价: 9.65, 折扣: 0.52 },
    { 商品类别: '办公用品', 销售渠道: '沃尔玛', 单价: 5.33, 折扣: 0.9 },
    { 商品类别: '设备', 销售渠道: '沃尔玛', 单价: 19127.65, 折扣: 0.15 },
    { 商品类别: '设备', 销售渠道: '沃尔玛', 单价: 17011.19, 折扣: 0.94 },
    { 商品类别: '设备', 销售渠道: '世纪联华', 单价: 19127.65, 折扣: 0.15 },
    { 商品类别: '办公用品', 销售渠道: '家乐福', 单价: 9.56, 折扣: 0.98 },
    { 商品类别: '办公用品', 销售渠道: '沃尔玛', 单价: 4.97, 折扣: 0.51 },
    { 商品类别: '家具', 销售渠道: '其他', 单价: 365.08, 折扣: 0.58 },
    { 商品类别: '办公用品', 销售渠道: '其他', 单价: 8.17, 折扣: 0.94 },
    { 商品类别: '办公用品', 销售渠道: '沃尔玛', 单价: 7.27, 折扣: 0.44 },
    { 商品类别: '办公用品', 销售渠道: '家乐福', 单价: 8.17, 折扣: 0.94 },
    { 商品类别: '办公用品', 销售渠道: '大润发', 单价: 9.56, 折扣: 0.98 },
    { 商品类别: '办公用品', 销售渠道: '世纪联华', 单价: 7.27, 折扣: 0.44 },
    { 商品类别: '办公用品', 销售渠道: '家乐福', 单价: 7.27, 折扣: 0.44 },
    { 商品类别: '办公用品', 销售渠道: '世纪联华', 单价: 4.49, 折扣: 0.3 },
    { 商品类别: '设备', 销售渠道: '世纪联华', 单价: 12683.93, 折扣: 0.58 },
    { 商品类别: '家具', 销售渠道: '大润发', 单价: 452.7, 折扣: 0.24 },
    { 商品类别: '家具', 销售渠道: '世纪联华', 单价: 289.18, 折扣: 0.85 },
    { 商品类别: '设备', 销售渠道: '大润发', 单价: 17518.8, 折扣: 0.16 },
    { 商品类别: '办公用品', 销售渠道: '世纪联华', 单价: 7.33, 折扣: 0.75 },
  ]);
  const advise = useCallback(async () => {
    const res = await advisor.advise({ data });
    const newChart = advisor.render({
      chartConfig: res.adviseCharts[0],
      data: res.data,
      metas: res.metas,
      uiConfig: {
        theme: 'academy',
        backgroundColor: '#eee',
        lineWidth: 5,
      },
    });

    setChart(newChart);
  }, [data]);

  return (
    <div>
      <JSONView json={data} />
      <button onClick={advise}>advise</button>
      <div>{chart}</div>
    </div>
  );
};

ReactDOM.render(<App />, document.getElementById('container'));
