export const city_gender_amount_incomplete = [
  { city: '上海', gender: '男性', amount: 155 },
  { city: '北京', gender: '女性', amount: 124 },
  { city: '北京', gender: '男性', amount: 62 },
  { city: '南京', gender: '男性', amount: 248 },
  { city: '广州', gender: '男性', amount: 186 },
  { city: '杭州', gender: '男性', amount: 186 },
];

export const city_gender_amount_complete = [
  { city: '上海', gender: '女性', amount: 155 },
  { city: '上海', gender: '男性', amount: 135 },
  { city: '北京', gender: '女性', amount: 124 },
  { city: '北京', gender: '男性', amount: 62 },
  { city: '南京', gender: '女性', amount: 148 },
  { city: '南京', gender: '男性', amount: 248 },
  { city: '广州', gender: '女性', amount: 192 },
  { city: '广州', gender: '男性', amount: 186 },
  { city: '杭州', gender: '女性', amount: 136 },
  { city: '杭州', gender: '男性', amount: 186 },
];

export const area_series_sales_complete = [
  {
    地区: '华东',
    细分: '公司',
    销售额: 1454715.807999998,
  },
  {
    地区: '华东',
    细分: '消费者',
    销售额: 2287358.261999998,
  },
  {
    地区: '华东',
    细分: '经销商',
    销售额: 1667358.261999998,
  },
  {
    地区: '中南',
    细分: '公司',
    销售额: 1335665.3239999984,
  },
  {
    地区: '中南',
    细分: '消费者',
    销售额: 2057936.7620000008,
  },
  {
    地区: '东北',
    细分: '公司',
    销售额: 834842.827,
  },
  {
    地区: '东北',
    细分: '消费者',
    销售额: 1323985.6069999991,
  },
  {
    地区: '华北',
    细分: '公司',
    销售额: 804769.4689999995,
  },
  {
    地区: '华北',
    细分: '消费者',
    销售额: 1220430.5610000012,
  },
  {
    地区: '西南',
    细分: '公司',
    销售额: 469341.684,
  },
  {
    地区: '西南',
    细分: '消费者',
    销售额: 677302.8919999995,
  },
  {
    地区: '西北',
    细分: '公司',
    销售额: 253458.1840000001,
  },
  {
    地区: '西北',
    细分: '消费者',
    销售额: 458058.1039999998,
  },
];
