export const city_gender_amount_incomplete = [
  { city: '上海', gender: '男性', amount: 155 },
  { city: '北京', gender: '女性', amount: 124 },
  { city: '北京', gender: '男性', amount: 62 },
  { city: '南京', gender: '男性', amount: 248 },
  { city: '广州', gender: '男性', amount: 186 },
  { city: '杭州', gender: '男性', amount: 186 },
];

export const city_gender_amount_complete = [
  { city: '上海', gender: '女性', amount: 155 },
  { city: '上海', gender: '男性', amount: 135 },
  { city: '北京', gender: '女性', amount: 124 },
  { city: '北京', gender: '男性', amount: 62 },
  { city: '南京', gender: '女性', amount: 148 },
  { city: '南京', gender: '男性', amount: 248 },
  { city: '广州', gender: '女性', amount: 192 },
  { city: '广州', gender: '男性', amount: 186 },
  { city: '杭州', gender: '女性', amount: 136 },
  { city: '杭州', gender: '男性', amount: 186 },
];

export const area_series_sales_complete = [
  {
    地区: '华东',
    细分: '公司',
    销售额: 1454715.807999998,
  },
  {
    地区: '华东',
    细分: '消费者',
    销售额: 2287358.261999998,
  },
  {
    地区: '华东',
    细分: '经销商',
    销售额: 1667358.261999998,
  },
  {
    地区: '中南',
    细分: '公司',
    销售额: 1335665.3239999984,
  },
  {
    地区: '中南',
    细分: '消费者',
    销售额: 2057936.7620000008,
  },
  {
    地区: '东北',
    细分: '公司',
    销售额: 834842.827,
  },
  {
    地区: '东北',
    细分: '消费者',
    销售额: 1323985.6069999991,
  },
  {
    地区: '华北',
    细分: '公司',
    销售额: 804769.4689999995,
  },
  {
    地区: '华北',
    细分: '消费者',
    销售额: 1220430.5610000012,
  },
  {
    地区: '西南',
    细分: '公司',
    销售额: 469341.684,
  },
  {
    地区: '西南',
    细分: '消费者',
    销售额: 677302.8919999995,
  },
  {
    地区: '西北',
    细分: '公司',
    销售额: 253458.1840000001,
  },
  {
    地区: '西北',
    细分: '消费者',
    销售额: 458058.1039999998,
  },
];

export const hier_categories = [
  {
    子类别: '投影仪',
    单价: 8611876.83,
    类别: '设备',
  },
  {
    子类别: '电话',
    单价: 3748330.01,
    类别: '设备',
  },
  {
    子类别: '复印机',
    单价: 3601334.1,
    类别: '设备',
  },
  {
    子类别: '配件',
    单价: 1926153.38,
    类别: '设备',
  },
  {
    子类别: '椅子',
    单价: 271451.62,
    类别: '家具',
  },
  {
    子类别: '书架',
    单价: 89510.6,
    类别: '家具',
  },
  {
    子类别: '桌子',
    单价: 74242.53,
    类别: '家具',
  },
  {
    子类别: '柜子',
    单价: 73628.46,
    类别: '家具',
  },
  {
    子类别: '信封',
    单价: 4499.55,
    类别: '办公用品',
  },
  {
    子类别: '橡皮',
    单价: 4065.6,
    类别: '办公用品',
  },
  {
    子类别: '本子',
    单价: 3893.76,
    类别: '办公用品',
  },
  {
    子类别: '收纳具',
    单价: 3834.6,
    类别: '办公用品',
  },
  {
    子类别: '纸张',
    单价: 3168.54,
    类别: '办公用品',
  },
  {
    子类别: '胶带',
    单价: 1350.54,
    类别: '办公用品',
  },
  {
    子类别: '便签纸',
    单价: 1110.41,
    类别: '办公用品',
  },
  {
    子类别: '装订机',
    单价: 905.58,
    类别: '办公用品',
  },
  {
    子类别: '笔',
    单价: 810.54,
    类别: '办公用品',
  },
];
